kamer1337/esp32-driver-ide/src/gui/imgui_window.cpp
#include "gui/imgui_window.h"
#include "editor/text_editor.h"
#include "file_manager/file_manager.h"
#include "compiler/esp32_compiler.h"
#include "serial/serial_monitor.h"
#include "ai_assistant/ai_assistant.h"

#include "imgui.h"
#include "imgui_impl_glfw.h"
#include "imgui_impl_opengl3.h"

#include <GLFW/glfw3.h>
#include <iostream>
#include <cstdio>
#include <algorithm>

namespace esp32_ide {
namespace gui {

// Constants
static constexpr size_t EDITOR_BUFFER_SIZE = 1024 * 1024; // 1MB buffer for text editor
static const char* DEFAULT_SKETCH_TEMPLATE = 
    "void setup() {\n"
    "  // put your setup code here, to run once:\n"
    "\n"
    "}\n"
    "\n"
    "void loop() {\n"
    "  // put your main code here, to run repeatedly:\n"
    "\n"
    "}\n";

static const char* SIMPLE_SKETCH_TEMPLATE = 
    "void setup() {\n"
    "\n"
    "}\n"
    "\n"
    "void loop() {\n"
    "\n"
    "}\n";

static void glfw_error_callback(int error, const char* description) {
    std::cerr << "GLFW Error " << error << ": " << description << std::endl;
}

ImGuiWindow::ImGuiWindow()
    : window_(nullptr),
      text_editor_(nullptr),
      file_manager_(nullptr),
      compiler_(nullptr),
      serial_monitor_(nullptr),
      show_file_explorer_(true),
      show_properties_panel_(true),
      show_ai_assistant_(true),
      current_center_tab_(0),
      active_editor_tab_(0),
      selected_port_index_(0),
      selected_baud_rate_(115200),
      is_connected_(false),
      connection_attempted_(false),
      scroll_to_bottom_(false),
      selected_file_index_(-1),
      cached_line_count_(0),
      line_count_dirty_(true),
      ai_scroll_to_bottom_(false) {
    
    // Initialize editor buffer with empty content (lazy initialization is better than memset)
    editor_buffer_[0] = '\0';
    ai_input_buffer_[0] = '\0';
    
    // Initialize baud rates
    baud_rates_ = {9600, 19200, 38400, 57600, 115200, 230400, 460800, 921600};
    
    // Initialize root folder structure
    root_folder_.name = "Project";
    root_folder_.path = "";
    root_folder_.is_folder = true;
}

ImGuiWindow::~ImGuiWindow() {
    Shutdown();
}

bool ImGuiWindow::Initialize(int width, int height) {
    // Setup GLFW
    glfwSetErrorCallback(glfw_error_callback);
    if (!glfwInit()) {
        std::cerr << "Failed to initialize GLFW" << std::endl;
        return false;
    }
    
    // GL 3.3 + GLSL 330
    const char* glsl_version = "#version 330";
    glfwWindowHint(GLFW_CONTEXT_VERSION_MAJOR, 3);
    glfwWindowHint(GLFW_CONTEXT_VERSION_MINOR, 3);
    glfwWindowHint(GLFW_OPENGL_PROFILE, GLFW_OPENGL_CORE_PROFILE);
#ifdef __APPLE__
    glfwWindowHint(GLFW_OPENGL_FORWARD_COMPAT, GL_TRUE);
#endif
    
    // Create window
    window_ = glfwCreateWindow(width, height, "ESP32 Driver IDE", nullptr, nullptr);
    if (window_ == nullptr) {
        std::cerr << "Failed to create GLFW window" << std::endl;
        glfwTerminate();
        return false;
    }
    
    glfwMakeContextCurrent(window_);
    glfwSwapInterval(1); // Enable vsync
    
    // Setup Dear ImGui context
    IMGUI_CHECKVERSION();
    ImGui::CreateContext();
    ImGuiIO& io = ImGui::GetIO();
    io.ConfigFlags |= ImGuiConfigFlags_NavEnableKeyboard;
    // Note: Docking feature requires ImGui docking branch
    // io.ConfigFlags |= ImGuiConfigFlags_DockingEnable;
    
    // Setup Platform/Renderer backends
    ImGui_ImplGlfw_InitForOpenGL(window_, true);
    ImGui_ImplOpenGL3_Init(glsl_version);
    
    // Setup style
    SetupImGuiStyle();
    
    AddConsoleMessage("ESP32 Driver IDE v1.0.0 initialized");
    AddConsoleMessage("ImGui interface ready");
    
    return true;
}

void ImGuiWindow::Run() {
    ImVec4 clear_color = ImVec4(0.1f, 0.1f, 0.1f, 1.0f);
    
    // Main loop
    while (!glfwWindowShouldClose(window_)) {
        glfwPollEvents();
        
        // Start the Dear ImGui frame
        ImGui_ImplOpenGL3_NewFrame();
        ImGui_ImplGlfw_NewFrame();
        ImGui::NewFrame();
        
        // Render UI
        RenderMainMenuBar();
        RenderToolbar();
        
        // Create main docking space
        ImGuiViewport* viewport = ImGui::GetMainViewport();
        ImGui::SetNextWindowPos(ImVec2(viewport->Pos.x, viewport->Pos.y + 80)); // After menu and toolbar
        ImGui::SetNextWindowSize(ImVec2(viewport->Size.x, viewport->Size.y - 280)); // Leave space for console
        
        ImGuiWindowFlags window_flags = ImGuiWindowFlags_NoTitleBar | ImGuiWindowFlags_NoCollapse |
                                       ImGuiWindowFlags_NoResize | ImGuiWindowFlags_NoMove |
                                       ImGuiWindowFlags_NoBringToFrontOnFocus | ImGuiWindowFlags_NoNavFocus;
        
        ImGui::Begin("MainDockSpace", nullptr, window_flags);
        
        // Four-column layout (added AI assistant)
        float window_width = ImGui::GetContentRegionAvail().x;
        float left_panel_width = show_file_explorer_ ? 250.0f : 0.0f;
        float right_panel_width = show_properties_panel_ ? 250.0f : 0.0f;
        float ai_panel_width = show_ai_assistant_ ? 300.0f : 0.0f;
        float center_panel_width = window_width - left_panel_width - right_panel_width - ai_panel_width;
        
        // Left panel - File Explorer
        if (show_file_explorer_) {
            ImGui::BeginChild("FileExplorer", ImVec2(left_panel_width, 0), true);
            RenderFileExplorer();
            ImGui::EndChild();
            ImGui::SameLine();
        }
        
        // Center panel - Editor/Debugger/RE tabs
        ImGui::BeginChild("CenterPanel", ImVec2(center_panel_width, 0), true);
        RenderCenterPanel();
        ImGui::EndChild();
        
        // Right panel - Properties
        if (show_properties_panel_) {
            ImGui::SameLine();
            ImGui::BeginChild("PropertiesPanel", ImVec2(right_panel_width, 0), true);
            RenderPropertiesPanel();
            ImGui::EndChild();
        }
        
        // AI Assistant panel
        if (show_ai_assistant_) {
            ImGui::SameLine();
            ImGui::BeginChild("AIAssistant", ImVec2(ai_panel_width, 0), true);
            RenderAIAssistant();
            ImGui::EndChild();
        }
        
        ImGui::End();
        
        // Console at the bottom
        ImGui::SetNextWindowPos(ImVec2(viewport->Pos.x, viewport->Pos.y + viewport->Size.y - 200));
        ImGui::SetNextWindowSize(ImVec2(viewport->Size.x, 200));
        ImGui::Begin("Console", nullptr, ImGuiWindowFlags_NoTitleBar | ImGuiWindowFlags_NoResize | ImGuiWindowFlags_NoMove);
        RenderConsole();
        ImGui::End();
        
        // Rendering
        ImGui::Render();
        int display_w, display_h;
        glfwGetFramebufferSize(window_, &display_w, &display_h);
        glViewport(0, 0, display_w, display_h);
        glClearColor(clear_color.x, clear_color.y, clear_color.z, clear_color.w);
        glClear(GL_COLOR_BUFFER_BIT);
        ImGui_ImplOpenGL3_RenderDrawData(ImGui::GetDrawData());
        
        glfwSwapBuffers(window_);
    }
}

