kamer1337/esp32-driver-ide/src/gui/imgui_window.cpp
void ImGuiWindow::Shutdown() {
    if (window_) {
        ImGui_ImplOpenGL3_Shutdown();
        ImGui_ImplGlfw_Shutdown();
        ImGui::DestroyContext();
        
        glfwDestroyWindow(window_);
        glfwTerminate();
        window_ = nullptr;
    }
}

void ImGuiWindow::SetTextEditor(TextEditor* editor) {
    text_editor_ = editor;
}

void ImGuiWindow::SetFileManager(FileManager* file_manager) {
    file_manager_ = file_manager;
    RefreshFileList();
    
    // Create an initial editor tab with sketch.ino if it exists
    if (file_manager_ && file_manager_->FileExists("sketch.ino")) {
        LoadFile("sketch.ino");
    } else {
        // Create a default tab
        EditorTab initial_tab;
        initial_tab.filename = "sketch.ino";
        initial_tab.content = DEFAULT_SKETCH_TEMPLATE;
        initial_tab.is_modified = false;
        std::snprintf(initial_tab.buffer, EDITOR_BUFFER_SIZE, "%s", initial_tab.content.c_str());
        editor_tabs_.push_back(initial_tab);
        active_editor_tab_ = 0;
    }
}

void ImGuiWindow::SetCompiler(ESP32Compiler* compiler) {
    compiler_ = compiler;
}

void ImGuiWindow::SetSerialMonitor(SerialMonitor* serial_monitor) {
    serial_monitor_ = serial_monitor;
    RefreshPortList();
}

void ImGuiWindow::RenderMainMenuBar() {
    if (ImGui::BeginMainMenuBar()) {
        if (ImGui::BeginMenu("File")) {
            if (ImGui::MenuItem("New", "Ctrl+N")) {
                // Create new editor tab
                EditorTab new_tab;
                new_tab.filename = "sketch_" + std::to_string(editor_tabs_.size() + 1) + ".ino";
                new_tab.content = DEFAULT_SKETCH_TEMPLATE;
                new_tab.is_modified = false;
                std::snprintf(new_tab.buffer, EDITOR_BUFFER_SIZE, "%s", new_tab.content.c_str());
                editor_tabs_.push_back(new_tab);
                active_editor_tab_ = editor_tabs_.size() - 1;
                line_count_dirty_ = true;
                AddConsoleMessage("Created new file: " + new_tab.filename);
            }
            if (ImGui::MenuItem("Save", "Ctrl+S")) {
                SaveFile();
            }
            ImGui::Separator();
            if (ImGui::MenuItem("Exit")) {
                glfwSetWindowShouldClose(window_, true);
            }
            ImGui::EndMenu();
        }
        
        if (ImGui::BeginMenu("View")) {
            ImGui::MenuItem("File Explorer", nullptr, &show_file_explorer_);
            ImGui::MenuItem("Properties Panel", nullptr, &show_properties_panel_);
            ImGui::MenuItem("AI Assistant", nullptr, &show_ai_assistant_);
            ImGui::EndMenu();
        }
        
        if (ImGui::BeginMenu("Tools")) {
            if (ImGui::MenuItem("Compile", "Ctrl+R")) {
                CompileCode();
            }
            if (ImGui::MenuItem("Upload", "Ctrl+U")) {
                UploadCode();
            }
            ImGui::EndMenu();
        }
        
        if (ImGui::BeginMenu("Help")) {
            if (ImGui::MenuItem("About")) {
                AddConsoleMessage("ESP32 Driver IDE v1.0.0 - Built with ImGui");
            }
            ImGui::EndMenu();
        }
        
        ImGui::EndMainMenuBar();
    }
}

void ImGuiWindow::RenderToolbar() {
    ImGuiViewport* viewport = ImGui::GetMainViewport();
    ImGui::SetNextWindowPos(ImVec2(viewport->Pos.x, viewport->Pos.y + 19)); // After menu bar
    ImGui::SetNextWindowSize(ImVec2(viewport->Size.x, 60));
    
    ImGui::Begin("Toolbar", nullptr, ImGuiWindowFlags_NoTitleBar | ImGuiWindowFlags_NoResize | 
                                     ImGuiWindowFlags_NoMove | ImGuiWindowFlags_NoScrollbar);
    
    // USB Port selector
    ImGui::Text("USB Port:");
    ImGui::SameLine();
    ImGui::SetNextItemWidth(150);
    if (ImGui::BeginCombo("##port", selected_port_.empty() ? "No port" : selected_port_.c_str())) {
        for (size_t i = 0; i < available_ports_.size(); i++) {
            bool is_selected = (selected_port_index_ == static_cast<int>(i));
            if (ImGui::Selectable(available_ports_[i].c_str(), is_selected)) {
                selected_port_index_ = i;
                selected_port_ = available_ports_[i];
                AddConsoleMessage("Selected port: " + selected_port_);
            }
            if (is_selected)
                ImGui::SetItemDefaultFocus();
        }
        ImGui::EndCombo();
    }
    
    ImGui::SameLine();
    if (ImGui::Button("Refresh Ports")) {
        RefreshPortList();
        AddConsoleMessage("Refreshed device list - found " + std::to_string(available_ports_.size()) + " device(s)");
    }
    
    ImGui::SameLine();
    ImGui::Separator();
    ImGui::SameLine();
    
    // Baud rate
    ImGui::Text("Baud:");
    ImGui::SameLine();
    ImGui::SetNextItemWidth(100);
    if (ImGui::BeginCombo("##baud", std::to_string(selected_baud_rate_).c_str())) {
        for (int baud : baud_rates_) {
            bool is_selected = (selected_baud_rate_ == baud);
            if (ImGui::Selectable(std::to_string(baud).c_str(), is_selected)) {
                selected_baud_rate_ = baud;
            }
            if (is_selected)
                ImGui::SetItemDefaultFocus();
        }
        ImGui::EndCombo();
    }
    
    ImGui::SameLine();
    ImGui::Separator();
    ImGui::SameLine();
    
    // Connect/Disconnect button with status
    if (!is_connected_) {
        if (ImGui::Button("Connect")) {
            ConnectToDevice();
        }
    } else {
        if (ImGui::Button("Disconnect")) {
            DisconnectFromDevice();
        }
    }
    
    // Show connection status
    if (connection_attempted_) {
        ImGui::SameLine();
        if (is_connected_) {
            ImGui::TextColored(ImVec4(0.0f, 1.0f, 0.0f, 1.0f), "✓ Connected");
        } else {
            ImGui::TextColored(ImVec4(1.0f, 0.0f, 0.0f, 1.0f), "✗ Failed");
        }
    }
    
    ImGui::SameLine();
    ImGui::Separator();
    ImGui::SameLine();
    
    // Action buttons
    if (ImGui::Button("Upload")) {
        UploadCode();
    }
    ImGui::SameLine();
    
    if (ImGui::Button("Download")) {
        DownloadFirmware();
    }
    ImGui::SameLine();
    
