kamer1337/esp32-driver-ide/src/gui/imgui_window.cpp
            if (!found) {
                // Create new tab
                EditorTab new_tab;
                new_tab.filename = node.name;
                
                if (file_manager_ && file_manager_->FileExists(node.name)) {
                    new_tab.content = file_manager_->GetFileContent(node.name);
                } else {
                    new_tab.content = "// File: " + node.name + "\n\n" + std::string(SIMPLE_SKETCH_TEMPLATE);
                }
                
                new_tab.is_modified = false;
                std::snprintf(new_tab.buffer, EDITOR_BUFFER_SIZE, "%s", new_tab.content.c_str());
                editor_tabs_.push_back(new_tab);
                active_editor_tab_ = editor_tabs_.size() - 1;
                
                AddConsoleMessage("Opened file: " + node.name);
            }
        }
    }
}

void ImGuiWindow::RenderAIAssistant() {
    ImGui::Text("AI Assistant");
    ImGui::Separator();
    
    // Chat history
    ImGui::BeginChild("AIChatHistory", ImVec2(0, -60), true);
    
    if (ai_chat_history_.empty()) {
        ImGui::TextWrapped("Welcome! I'm your ESP32 & Arduino programming assistant. Ask me anything about:");
        ImGui::BulletText("GPIO pin configuration");
        ImGui::BulletText("WiFi and Bluetooth setup");
        ImGui::BulletText("Sensor integration");
        ImGui::BulletText("Code debugging");
        ImGui::BulletText("Best practices");
    } else {
        for (const auto& exchange : ai_chat_history_) {
            // User message
            ImGui::PushStyleColor(ImGuiCol_Text, ImVec4(0.4f, 0.8f, 1.0f, 1.0f));
            ImGui::TextWrapped("You: %s", exchange.first.c_str());
            ImGui::PopStyleColor();
            ImGui::Spacing();
            
            // Assistant message
            ImGui::PushStyleColor(ImGuiCol_Text, ImVec4(0.4f, 1.0f, 0.4f, 1.0f));
            ImGui::TextWrapped("AI: %s", exchange.second.c_str());
            ImGui::PopStyleColor();
            ImGui::Separator();
        }
    }
    
    if (ai_scroll_to_bottom_) {
        ImGui::SetScrollHereY(1.0f);
        ai_scroll_to_bottom_ = false;
    }
    
    ImGui::EndChild();
    
    // Input area
    ImGui::Separator();
    if (ImGui::InputText("##aiinput", ai_input_buffer_, sizeof(ai_input_buffer_), ImGuiInputTextFlags_EnterReturnsTrue)) {
        std::string message = std::string(ai_input_buffer_);
        if (!message.empty()) {
            SendAIMessage(message);
            ai_input_buffer_[0] = '\0';
        }
    }
    ImGui::SameLine();
    if (ImGui::Button("Send")) {
        std::string message = std::string(ai_input_buffer_);
        if (!message.empty()) {
            SendAIMessage(message);
            ai_input_buffer_[0] = '\0';
        }
    }
}

void ImGuiWindow::SendAIMessage(const std::string& message) {
    // Get current code from active tab if available
    std::string current_code = "";
    if (!editor_tabs_.empty() && active_editor_tab_ < editor_tabs_.size()) {
        current_code = editor_tabs_[active_editor_tab_].content;
    }
    
    // Create AI assistant instance
    auto ai_assistant = std::make_unique<esp32_ide::AIAssistant>();
    
    // Query AI assistant with code context
    std::string response;
    
    // If message asks about code, provide context
    if (!current_code.empty() && 
        (message.find("code") != std::string::npos || 
         message.find("error") != std::string::npos ||
         message.find("fix") != std::string::npos ||
         message.find("analyze") != std::string::npos)) {
        response = ai_assistant->AnalyzeCode(current_code) + "\n\n" + ai_assistant->Query(message);
    } else {
        response = ai_assistant->Query(message);
    }
    
    // Add to chat history
    ai_chat_history_.push_back(std::make_pair(message, response));
    ai_scroll_to_bottom_ = true;
    
    AddConsoleMessage("AI: Responded to query about: " + message.substr(0, 50) + (message.length() > 50 ? "..." : ""));
}

void ImGuiWindow::AddConsoleMessage(const std::string& message) {
    console_messages_.push_back("[" + std::to_string(console_messages_.size()) + "] " + message);
    scroll_to_bottom_ = true;
}

void ImGuiWindow::SetupImGuiStyle() {
    ImGuiStyle& style = ImGui::GetStyle();
    
    // Dark theme colors
    ImVec4* colors = style.Colors;
    colors[ImGuiCol_Text]                   = ImVec4(1.00f, 1.00f, 1.00f, 1.00f);
    colors[ImGuiCol_TextDisabled]           = ImVec4(0.50f, 0.50f, 0.50f, 1.00f);
    colors[ImGuiCol_WindowBg]               = ImVec4(0.10f, 0.10f, 0.10f, 1.00f);
    colors[ImGuiCol_ChildBg]                = ImVec4(0.12f, 0.12f, 0.12f, 1.00f);
    colors[ImGuiCol_PopupBg]                = ImVec4(0.08f, 0.08f, 0.08f, 0.94f);
    colors[ImGuiCol_Border]                 = ImVec4(0.43f, 0.43f, 0.50f, 0.50f);
    colors[ImGuiCol_FrameBg]                = ImVec4(0.16f, 0.29f, 0.48f, 0.54f);
    colors[ImGuiCol_FrameBgHovered]         = ImVec4(0.26f, 0.59f, 0.98f, 0.40f);
    colors[ImGuiCol_FrameBgActive]          = ImVec4(0.26f, 0.59f, 0.98f, 0.67f);
    colors[ImGuiCol_TitleBg]                = ImVec4(0.04f, 0.04f, 0.04f, 1.00f);
    colors[ImGuiCol_TitleBgActive]          = ImVec4(0.16f, 0.29f, 0.48f, 1.00f);
    colors[ImGuiCol_MenuBarBg]              = ImVec4(0.14f, 0.14f, 0.14f, 1.00f);
    colors[ImGuiCol_ScrollbarBg]            = ImVec4(0.02f, 0.02f, 0.02f, 0.53f);
    colors[ImGuiCol_ScrollbarGrab]          = ImVec4(0.31f, 0.31f, 0.31f, 1.00f);
    colors[ImGuiCol_ScrollbarGrabHovered]   = ImVec4(0.41f, 0.41f, 0.41f, 1.00f);
    colors[ImGuiCol_ScrollbarGrabActive]    = ImVec4(0.51f, 0.51f, 0.51f, 1.00f);
    colors[ImGuiCol_CheckMark]              = ImVec4(0.26f, 0.59f, 0.98f, 1.00f);
    colors[ImGuiCol_SliderGrab]             = ImVec4(0.24f, 0.52f, 0.88f, 1.00f);
    colors[ImGuiCol_Button]                 = ImVec4(0.26f, 0.59f, 0.98f, 0.40f);
    colors[ImGuiCol_ButtonHovered]          = ImVec4(0.26f, 0.59f, 0.98f, 1.00f);
    colors[ImGuiCol_ButtonActive]           = ImVec4(0.06f, 0.53f, 0.98f, 1.00f);
    colors[ImGuiCol_Header]                 = ImVec4(0.26f, 0.59f, 0.98f, 0.31f);
    colors[ImGuiCol_HeaderHovered]          = ImVec4(0.26f, 0.59f, 0.98f, 0.80f);
    colors[ImGuiCol_HeaderActive]           = ImVec4(0.26f, 0.59f, 0.98f, 1.00f);
    colors[ImGuiCol_Tab]                    = ImVec4(0.18f, 0.35f, 0.58f, 0.86f);
    colors[ImGuiCol_TabHovered]             = ImVec4(0.26f, 0.59f, 0.98f, 0.80f);
    colors[ImGuiCol_TabActive]              = ImVec4(0.20f, 0.41f, 0.68f, 1.00f);
    
    // Rounding
    style.WindowRounding    = 0.0f;
    style.ChildRounding     = 0.0f;
    style.FrameRounding     = 3.0f;
    style.ScrollbarRounding = 3.0f;
    style.GrabRounding      = 3.0f;
    style.TabRounding       = 3.0f;
}

} // namespace gui
} // namespace esp32_ide
